# 1:1 문의 게시판
select * from ask;

create table ask(
id	int auto_increment primary key,
title	varchar(100),
pname	varchar(100),
pw	varchar(100),
upfile	varchar(100),
content	varchar(9999),
reg_date	timestamp,
cnt	int,
seq int,
lev int,
gid int
);

drop table ask;

#더미데이터
insert into ask (title, pname, pw, content, reg_date, cnt, seq, lev, gid)
values
('문의드립니다.','콩쥐','1111','콩쥐네 한정식 채용공고 어딨나요','2023-04-01',0,0,0,1),
('문의드립니다','팥쥐','1111','팥쥐네 한정식 채용공고 어딨나요?','2023-04-01',0,0,0,2),
('문의드립니다','두꺼비','1111','두꺼비 한정식 채용공고 어딨나요?','2023-04-01',0,0,0,3),
('문의드립니다','심청이','1111','심청이 한정식 채용 0명은 몇명 뽑는다는건가요?','2023-04-01',0,0,0,4),
('문의드립니다','심봉사','1111','심봉사 지원했는데 저한테 연락이 안오는데요','2023-04-01',0,0,0,5),
('안녕하세요 관리자님!', '구직자', '1111', '사람인 사이트를 통해 토끼네 한정식의 신규 채용 공고를 확인하려고 합니다. 어떻게 찾을 수 있나요?', '2023-04-01', 0, 0, 0, 6),
('안녕하세요 관리자님!', '구직자', '1111', '사슴네 한정식의 최신 채용 정보를 찾고 있습니다. 어떻게 검색해야 할까요?', '2023-04-02', 0, 0, 0, 7),
('안녕하세요 관리자님!', '구직자', '1111', '호랑이네 한정식의 채용 공고를 확인하려고 합니다. 검색하는 방법을 가르쳐 주세요.', '2023-04-03', 0, 0, 0, 8),
('안녕하세요 오왕 관리자님!', '구직자', '1111', '곰네 한정식의 신규 채용 정보를 찾고 있습니다. 어디서 검색해야 할까요?', '2023-04-04', 0, 0, 0, 9),
('관리자님!', 'user1', '1111', '원숭이네 한정식의 채용 공고를 확인하려면 어떻게 해야 하나요? 도움 부탁드립니다.', '2023-04-05', 0, 0, 0, 10),
('답변입니다.', '관리자', '1111', '콩쥐네 한정식 채용공고는 여기 있습니다.', '2023-04-02', 0, 0, 1, 1),
('답변입니다.', '관리자', '1111', '팥쥐네 한정식 채용공고는 다음과 같습니다.', '2023-04-02', 0, 0, 1, 2),
('답변입니다.', '관리자', '1111', '두꺼비네 한정식 채용공고는 다음과 같습니다.', '2023-04-02', 0, 0, 1, 3),
('답변입니다.', '관리자', '1111', '심청이네 한정식 채용공고는 다음과 같습니다.', '2023-04-02', 0, 0, 1, 4),
('답변입니다.', '관리자', '1111', '심봉사네 한정식 채용공고는 다음과 같습니다.', '2023-04-02', 0, 0, 1, 5),
('답변입니다.', '관리자', '1111', '토끼네 한정식 채용공고 검색 방법은 다음과 같습니다.', '2023-04-02', 0, 0, 1, 6),
('답변입니다.', '관리자', '1111', '사슴네 한정식 채용공고 검색 방법은 다음과 같습니다.', '2023-04-02', 0, 0, 1, 7),
('답변입니다.', '관리자', '1111', '호랑이네 한정식 채용공고 검색 방법은 다음과 같습니다.', '2023-04-02', 0, 0, 1, 8),
('답변입니다.', '관리자', '1111', '곰네 한정식 채용공고 검색 방법은 다음과 같습니다.', '2023-04-02', 0, 0, 1, 9),
('답변입니다.', '관리자', '1111', '원숭이네 한정식 채용공고 검색 방법은 다음과 같습니다.', '2023-04-02', 0, 0, 1, 10),
('질문입니다.', 'user3', '1111', '채용공고사이트에 관한 질문', '2023-09-21', 0, 0, 0, 11),
('답변입니다.', '관리자', '1111', '채용공고사이트에 관한 답변', '2023-09-22', 0, 0, 1, 11),
('질문입니다.', 'user4', '1111', '채용공고사이트에 관한 질문', '2023-09-23', 0, 0, 0, 12),
('답변입니다.', '관리자', '1111', '채용공고사이트에 관한 답변', '2023-09-24', 0, 0, 1, 12),
('질문입니다.', 'user6', '1111', '채용공고사이트에 관한 질문', '2023-09-30', 0, 0, 0, 13),
('답변입니다.', '관리자', '1111', '채용공고사이트에 관한 답변', '2023-10-01', 0, 0, 1, 13),
('질문입니다.', 'user5', '1111', '채용공고사이트에 관한 질문', '2023-10-02', 0, 0, 0, 14),
('답변입니다.', '관리자', '1111', '채용공고사이트에 관한 답변', '2023-10-03', 0, 0, 1, 14);