# 1:1 문의 게시판
select * from ask;

#삭제
drop table ask;

create table ask(
id	int auto_increment primary key,
title	varchar(100),
pname	varchar(100),
imp VARCHAR(100),
upfile	varchar(100),
content	varchar(9999),
reg_date	timestamp,
cnt	int,
seq int,
lev int,
gid int
);

# pw가 있는 경우
ALTER TABLE ask CHANGE pw imp VARCHAR(100);


# 초기 더미데이터
insert into ask (id, title, pname, content, reg_date, cnt, seq, lev, gid) values
(1,'문의드립니다.','user1','채용공고 어딨나요','2023-09-01',0,0,0,1),
(2,'문의드립니다','user2','환불가능한가요??','2023-09-01',0,0,0,2),
(3,'문의드립니다','user3','한정식 채용공고 어딨나요?','2023-09-01',0,0,0,3),
(4,'문의드립니다','user1','채용 0명은 몇명 뽑는다는건가요?','2023-09-01',0,0,0,4),
(5,'문의드립니다','user2','고객센터 번호 알려주세요','2023-09-01',0,0,0,5),
(6, '답변입니다.', '관리자', '채용게시판에서 확인 가능합니다.', '2023-09-02', 0, 1, 1, 1),
(7, '답변입니다.', '관리자', '네 가능합니다. 결제 후 환불원하시면 문의글 남겨주시면 확인해드리겠습니다.', '2023-09-02', 0, 1, 1, 2),
(8, '답변입니다.', '관리자', '채용공고에서 확인 가능합니다.', '2023-09-02', 0, 1, 1, 3),
(9, '답변입니다.', '관리자', '한자리수 구하는겁니다.', '2023-09-02', 0, 1, 1, 4),
(10, '답변입니다.', '관리자', '02-1234-1234입니다.', '2023-09-02', 0, 1, 1, 5),
(11,'안녕하세요 관리자님!', '구직자', '사람인 사이트를 통해 토끼네 한정식의 신규 채용 공고를 확인하려고 합니다. 어떻게 찾을 수 있나요?', '2023-09-03', 0, 0, 0, 11),
(12,'안녕하세요 관리자님!', '구직자', '사슴네 한정식의 최신 채용 정보를 찾고 있습니다. 어떻게 검색해야 할까요?', '2023-09-03', 0, 0, 0, 12),
(13,'안녕하세요 관리자님!', '구직자', '호랑이네 한정식의 채용 공고를 확인하려고 합니다. 검색하는 방법을 가르쳐 주세요.', '2023-09-03', 0, 0, 0, 13),
(14,'안녕하세요 오왕 관리자님!', '구직자', '곰네 한정식의 신규 채용 정보를 찾고 있습니다. 어디서 검색해야 할까요?', '2023-09-04', 0, 0, 0, 14),
(15,'관리자님!', 'user1', '원숭이네 한정식의 채용 공고를 확인하려면 어떻게 해야 하나요? 도움 부탁드립니다.', '2023-09-05', 0, 0, 0, 15),
(16,'답변입니다.', '관리자', '토끼네 한정식 채용공고 검색 방법은 다음과 같습니다.', '2023-09-06', 0, 1, 1, 16),
(17,'답변입니다.', '관리자', '사슴네 한정식 채용공고 검색 방법은 다음과 같습니다.', '2023-09-06', 0, 1, 1, 17),
(18,'답변입니다.', '관리자', '호랑이네 한정식 채용공고 검색 방법은 다음과 같습니다.', '2023-09-06', 0, 1, 1, 18),
(19,'답변입니다.', '관리자', '곰네 한정식 채용공고 검색 방법은 다음과 같습니다.', '2023-09-06', 0, 1, 1, 19),
(20,'답변입니다.', '관리자', '원숭이네 한정식 채용공고 검색 방법은 다음과 같습니다.', '2023-09-06', 0, 1, 1, 20),
(21,'질문입니다.', 'user3', '채용공고사이트에 관한 질문', '2023-09-21', 0, 0, 0, 21),
(22,'질문입니다.', 'user4', '채용공고사이트에 관한 질문', '2023-09-22', 0, 0, 0, 22),
(23,'질문입니다.', 'user5', '채용공고사이트에 관한 질문', '2023-09-22', 0, 0, 0, 23),
(24,'질문입니다.', 'user6', '채용공고사이트에 관한 질문', '2023-10-01', 0, 0, 0, 24),
(25,'답변입니다.', '관리자', '채용공고사이트에 관한 답변', '2023-09-22', 0, 1, 1, 21),
(26,'답변입니다.', '관리자', '채용공고사이트에 관한 답변', '2023-09-24', 0, 1, 1, 22),
(27,'답변입니다.', '관리자', '채용공고사이트에 관한 답변', '2023-09-24', 0, 1, 1, 23),
(28,'답변입니다.', '관리자', '채용공고사이트에 관한 답변', '2023-10-03', 0, 1, 1, 24);

