select * from recruit;
# 임시로 만듬 채용 테이블 recruit
# recruit_id 무결성을 위한 id
# recruit_title 채용 게시판 이름 
# recruit_name 체용 게시판에 작성한 기업 이름 !!! 기업 이름과 교체 !!!
# recruit_upfile 체용 게시판에 업로드한 이미지 파일
# recruit_content 체용 게시판에 작성한 내용
# reg_date 체용 게시판 작성일
#  recruit_magam 채용 게시판 마감일 선택한 수,
# cnt 체용 게시판 조회수
CREATE TABLE recruit (
    recruit_id INT AUTO_INCREMENT PRIMARY KEY,
    cid VARCHAR(100),
    recruit_title VARCHAR(100),
    recruit_upfile VARCHAR(100),
    recruit_content VARCHAR(9999),
    reg_date TIMESTAMP,
    regMagam TIMESTAMP,
    recruit_magam INT,
    cnt INT,
    recruit_money Int
    
);
select * from recruit where cid = 'company1' order by reg_date desc limit 0, 5;
select * from recruit;
-- 2월 데이터 추가 (5개)
INSERT INTO recruit (
    recruit_title, cid, recruit_content, recruit_upfile, reg_date, recruit_money,
    recruit_magam, cnt, realMagam
)
VALUES


('3월 채용 공고9', 'company5', '3월 채용 공고 내용입니다.', '파일명2.txt', '2023-03-06 00:00:00', 60000, 7, 0, '2023-02-22 00:00:00'),
('3월 채용 공고10', 'company5', '3월 채용 공고 내용입니다.', '파일명2.txt', '2023-03-07 00:00:00', 60000, 7, 0, '2023-02-22 00:00:00'),
('3월 채용 공고11', 'company5', '3월 채용 공고 내용입니다.', '파일명2.txt', '2023-03-13 00:00:00', 60000, 7, 0, '2023-02-22 00:00:00'),
('3월 채용 공고12', 'company5', '3월 채용 공고 내용입니다.', '파일명2.txt', '2023-03-14 00:00:00', 60000, 7, 0, '2023-02-22 00:00:00');

-- 4월 데이터 추가 (5개)
INSERT INTO recruit (
    recruit_title, cid, recruit_content, recruit_upfile, reg_date, recruit_money,
    recruit_magam, cnt, realMagam
)
VALUES
('4월 채용 공고1', 'company1', '4월 채용 공고 내용입니다.', '파일명1.txt', '2023-04-01 00:00:00', 80000, 30, 0, '2023-04-30 00:00:00'),
('4월 채용 공고2', 'company2', '4월 채용 공고 내용입니다.', '파일명2.txt', '2023-04-05 00:00:00', 90000, 30, 0, '2023-05-05 00:00:00'),
('4월 채용 공고3', 'company3', '4월 채용 공고 내용입니다.', '파일명3.txt', '2023-04-10 00:00:00', 100000, 30, 0, '2023-05-10 00:00:00'),
('4월 채용 공고4', 'company4', '4월 채용 공고 내용입니다.', '파일명4.txt', '2023-04-15 00:00:00', 110000, 30, 0, '2023-05-15 00:00:00'),
('4월 채용 공고5', 'company5', '4월 채용 공고 내용입니다.', '파일명5.txt', '2023-04-20 00:00:00', 120000, 30, 0, '2023-05-20 00:00:00');


-- 5월 데이터 추가 (5개)
INSERT INTO recruit (
    recruit_title, cid, recruit_content, recruit_upfile, reg_date, recruit_money,
    recruit_magam, cnt, realMagam
)
VALUES
('5월 채용 공고1', 'company1', '5월 채용 공고 내용입니다.', '파일명1.txt', '2023-05-01 00:00:00', 100000, 120, 0, '2023-08-29 00:00:00'),
('5월 채용 공고2', 'company2', '5월 채용 공고 내용입니다.', '파일명2.txt', '2023-05-05 00:00:00', 110000, 120, 0, '2023-09-02 00:00:00'),
('5월 채용 공고3', 'company3', '5월 채용 공고 내용입니다.', '파일명3.txt', '2023-05-10 00:00:00', 120000, 120, 0, '2023-09-07 00:00:00'),
('5월 채용 공고4', 'company4', '5월 채용 공고 내용입니다.', '파일명4.txt', '2023-05-15 00:00:00', 130000, 120, 0, '2023-09-12 00:00:00'),
('5월 채용 공고5', 'company5', '5월 채용 공고 내용입니다.', '파일명5.txt', '2023-05-20 00:00:00', 140000, 120, 0, '2023-09-17 00:00:00');

-- 6월 데이터 추가 (5개)
INSERT INTO recruit (
    recruit_title, cid, recruit_content, recruit_upfile, reg_date, recruit_money,
    recruit_magam, cnt, realMagam
)
VALUES
('6월 채용 공고1', 'company1', '6월 채용 공고 내용입니다.', '파일명1.txt', '2023-06-01 00:00:00', 150000, 240, 0, '2023-09-29 00:00:00'),
('6월 채용 공고2', 'company2', '6월 채용 공고 내용입니다.', '파일명2.txt', '2023-06-05 00:00:00', 160000, 240, 0, '2023-10-03 00:00:00'),
('6월 채용 공고3', 'company3', '6월 채용 공고 내용입니다.', '파일명3.txt', '2023-06-10 00:00:00', 170000, 240, 0, '2023-10-08 00:00:00'),
('6월 채용 공고4', 'company4', '6월 채용 공고 내용입니다.', '파일명4.txt', '2023-06-15 00:00:00', 180000, 240, 0, '2023-10-13 00:00:00'),
('6월 채용 공고5', 'company5', '6월 채용 공고 내용입니다.', '파일명5.txt', '2023-06-20 00:00:00', 190000, 240, 0, '2023-10-18 00:00:00');

-- 7월 데이터 추가 (5개)
INSERT INTO recruit (
    recruit_title, cid, recruit_content, recruit_upfile, reg_date, recruit_money,
    recruit_magam, cnt, realMagam
)
VALUES
('7월 채용 공고1', 'company1', '7월 채용 공고 내용입니다.', '파일명1.txt', '2023-07-01 00:00:00', 200000, 480, 0, '2023-11-28 00:00:00'),
('7월 채용 공고2', 'company2', '7월 채용 공고 내용입니다.', '파일명2.txt', '2023-07-05 00:00:00', 210000, 480, 0, '2023-12-02 00:00:00'),
('7월 채용 공고3', 'company3', '7월 채용 공고 내용입니다.', '파일명3.txt', '2023-07-10 00:00:00', 220000, 480, 0, '2023-12-07 00:00:00'),
('7월 채용 공고4', 'company4', '7월 채용 공고 내용입니다.', '파일명4.txt', '2023-07-15 00:00:00', 230000, 480, 0, '2023-12-12 00:00:00'),
('7월 채용 공고5', 'company5', '7월 채용 공고 내용입니다.', '파일명5.txt', '2023-07-20 00:00:00', 240000, 480, 0, '2023-12-17 00:00:00');

-- 7월 데이터 추가 (5개)
INSERT INTO recruit (
    recruit_title, cid, recruit_content, recruit_upfile, reg_date, recruit_money,
    recruit_magam, cnt, realMagam
)
VALUES
('7월 채용 공고1', 'company1', '7월 채용 공고 내용입니다.', '파일명1.txt', '2023-07-01 00:00:00', 130000, 30, 0, '2023-07-31 00:00:00'),
('7월 채용 공고2', 'company2', '7월 채용 공고 내용입니다.', '파일명2.txt', '2023-07-05 00:00:00', 140000, 30, 0, '2023-08-04 00:00:00'),
('7월 채용 공고3', 'company3', '7월 채용 공고 내용입니다.', '파일명3.txt', '2023-07-10 00:00:00', 150000, 30, 0, '2023-08-09 00:00:00'),
('7월 채용 공고4', 'company4', '7월 채용 공고 내용입니다.', '파일명4.txt', '2023-07-15 00:00:00', 160000, 30, 0, '2023-08-14 00:00:00'),
('7월 채용 공고5', 'company5', '7월 채용 공고 내용입니다.', '파일명5.txt', '2023-07-20 00:00:00', 170000, 30, 0, '2023-08-19 00:00:00');

-- 8월 데이터 추가 (5개)
INSERT INTO recruit (
    recruit_title, cid, recruit_content, recruit_upfile, reg_date, recruit_money,
    recruit_magam, cnt, realMagam
)
VALUES
('8월 채용 공고1', 'company1', '8월 채용 공고 내용입니다.', '파일명1.txt', '2023-08-01 00:00:00', 180000, 30, 0, '2023-08-31 00:00:00'),
('8월 채용 공고2', 'company2', '8월 채용 공고 내용입니다.', '파일명2.txt', '2023-08-05 00:00:00', 190000, 30, 0, '2023-09-04 00:00:00'),
('8월 채용 공고3', 'company3', '8월 채용 공고 내용입니다.', '파일명3.txt', '2023-08-10 00:00:00', 200000, 30, 0, '2023-09-09 00:00:00'),
('8월 채용 공고4', 'company4', '8월 채용 공고 내용입니다.', '파일명4.txt', '2023-08-15 00:00:00', 210000, 30, 0, '2023-09-14 00:00:00'),
('8월 채용 공고5', 'company5', '8월 채용 공고 내용입니다.', '파일명5.txt', '2023-08-20 00:00:00', 220000, 30, 0, '2023-09-19 00:00:00');


select * from recruit;
-- 더미데이터 (은별)
# 더미 테스트
insert into recruit(
   recruit_title,
   cid,
    recruit_content,
    reg_date,
    cnt
    )
values
('콩쥐네 직원을 구합니다.' , 'company1'  ,'성실한 인재를 구합니다. 채용모집 0명 / 남녀상관없음/','2023-05-04',1),
('요리사 급구', 'company2', '능력 있는 지원자를 찾습니다.', '2023-05-06', 1),
('요리사 급구', 'company3', '팀원을 모집합니다.', '2023-05-08', 1),
('성실한 직원을 구합니다.', 'company4', '경험 있는 요리사를 찾습니다.', '2023-05-10', 1),
('팥쥐네 직원을 구합니다.' , 'company2'  ,'성실한 인재를 구합니다. 채용모집 0명 /','2023-06-04',1),
('팥쥐네 급구', 'company3', '능력 있는 지원자를 찾습니다.', '2023-06-06', 1),
('두꺼비네 급구', 'company4', '팀원을 모집합니다.', '2023-06-08', 1),
('콩쥐네 직원 구합니다.', 'company1', '경험 있는 요리사를 찾습니다.', '2023-06-10', 1);


-- 7월
insert into recruit(
   recruit_title,
   cid,
    recruit_content,
    reg_date,
    cnt
    )
values
('콩쥐네 직원을 구합니다.' , 'company1'  ,'성실한 인재를 구합니다. 채용모집 0명 / 남녀상관없음/','2023-07-04',1),
('요리사 급구', 'company2', '능력 있는 지원자를 찾습니다.', '2023-07-06', 1),
('요리사 급구', 'company3', '팀원을 모집합니다.', '2023-07-08', 1),
('성실한 직원을 구합니다.', 'company4', '경험 있는 요리사를 찾습니다.', '2023-07-10', 1),
('팥쥐네 직원을 구합니다.' , 'company2'  ,'성실한 인재를 구합니다. 채용모집 0명 /','2023-07-07',1),
('팥쥐네 급구', 'company3', '능력 있는 지원자를 찾습니다.', '2023-07-07', 1),
('두꺼비네 급구', 'company4', '팀원을 모집합니다.', '2023-07-18', 1),
('요리사[급구]', 'company1', '경험 있는 요리사를 찾습니다.', '2023-07-17', 1),
('요리사 구합니다.', 'company2', '능력 있는 지원자를 찾습니다.', '2023-07-20', 1),
('성실한 요리사 급구', 'company3', '팀을 이끌어 갈 직원들을 모집합니다.', '2023-07-22', 1);


-- 8월
insert into recruit(
   recruit_title,
   cid,
    recruit_content,
    reg_date,
    cnt
    )
values
('스탭 모집' , 'company1'  ,'성실한 인재를 구합니다. 친절한 스탭을 구합니다. 채용모집 0명 / 남녀상관없음 /','2023-08-04',1),
('[휴가철] 요리사 급구', 'company2', '능력 있는 지원자를 찾습니다.', '2023-08-06', 1),
('휴가철 비상 요리사 급구', 'company3', '팀원을 모집합니다.', '2023-08-08', 1),
('성실한 직원을 구합니다. 단순알바 지원 금지', 'company4', '경험 있는 요리사를 찾습니다.', '2023-08-10', 1),
('팥쥐네에서 직원을 구합니다.' , 'company2'  ,'성실한 인재를 구합니다. 채용모집 0명 /','2023-08-17',1),
('팥쥐네에서  [단순 요리사] [급구]', 'company3', '능력 있는 지원자를 찾습니다.', '2023-08-18', 1),
('두꺼비네 급구 친절하고 성실한 직원 구합니다.', 'company4', '팀원을 모집합니다.', '2023-08-19', 1),
('요리사[급구]', 'company1', '경험 있는 요리사를 찾습니다.', '2023-07-17', 1),
('요리사 구합니다.', 'company2', '능력 있는 지원자를 찾습니다.', '2023-07-20', 1),
('성실한 요리사 급구', 'company3', '팀을 이끌어 갈 직원들을 모집합니다. 급여는 회사내규, 합격일자는 따로 연락드릴 예정입니다.', '2023-07-22', 1);


-- 9월은
insert into recruit(
   recruit_title,
   cid,
    recruit_content,
    reg_date,
    cnt
    )
values
('[추석]연휴에 함께할 요리사를 모집합니다.' , 'company1'  ,'성실한 인재를 구합니다!
저희 한정식집은 17년째 근속하는 직원들과 함께하고 있습니다.
많은 지원 부탁드립니다^^

* 채용인원 : 0명
* 급여 : 회사내규
* 정규직 채용
* 공휴일 근무자 환영
* 한식 조리사 자격증 환영

감사합니다.','2023-09-01',1),
('[추석] 요리사 채용', 'company2', '요리사를 모집합니다! 성실하고 열정적인 지원자를 기다립니다.
* 채용인원: 0명
* 급여: 협의
* 정규직 채용
* 경력자 우대
* 연휴 근무 가능
* 한식 조리사 자격증 소지자 우대', '2023-09-02', 1),
('[급구] 주방 스탭 모집', 'company3', '주방 스탭을 급하게 모집합니다. 요리 경험이 있는 분 우대.
* 채용인원: 2명
* 급여: 회사 내규
* 정규직 채용
* 무경력자도 지원 가능
* 주말 근무 가능한 분 우대', '2023-09-03', 1),
('[신입] 주방 보조 스탭 채용', 'company4', '신입 주방 보조 스탭을 모집합니다. 요리에 관심 있는 분 환영합니다.
* 채용인원: 1명
* 급여: 시급
* 아르바이트 채용
* 학생 및 초심자 환영
* 주말 근무 가능한 분 우대', '2023-09-04', 1),
('한식 조리사 모집', 'company5', '한식 조리사를 모집합니다. 경력자 우대합니다.
* 채용인원: 1명
* 급여: 협의
* 정규직 채용
* 경력자 우대
* 식당 업무 경험자 환영', '2023-09-05', 1),
('[신입] 서빙 스탭 채용', 'company1', '신입 서빙 스탭을 모집합니다. 아르바이트로서의 업무를 경험해보고 싶은 분 환영합니다.
* 채용인원: 2명
* 급여: 시급
* 아르바이트 채용
* 경력 무관
* 주말 근무 가능한 분 환영', '2023-09-06', 1),
('[경력자] 주방 스탭 채용', 'company2', '경력자 주방 스탭을 모집합니다. 레스토랑에서의 경험이 있는 분 우대.
* 채용인원: 1명
* 급여: 회사 내규
* 정규직 채용
* 경력자 우대
* 주말 근무 가능한 분 우대', '2023-09-07', 1),
('[아르바이트] 서빙 스탭 채용', 'company3', '서빙 스탭 아르바이트를 모집합니다. 아르바이트 경험이 있는 분 환영합니다.
* 채용인원: 2명
* 급여: 시급
* 아르바이트 채용
* 경력 무관
* 주말 근무 가능한 분 환영', '2023-09-08', 1),
('[주부] 주방 보조 스탭 채용', 'company4', '주부 주방 보조 스탭을 모집합니다. 주부분들 환영합니다.
* 채용인원: 1명
* 급여: 시급
* 아르바이트 채용
* 경력 무관
* 주말 근무 가능한 분 환영', '2023-09-09', 1),
('레스토랑 서빙 스탭 채용', 'company5', '레스토랑 서빙 스탭을 모집합니다. 서빙 경험이 있는 분 우대.
* 채용인원: 2명
* 급여: 회사 내규
* 정규직 채용
* 경력자 우대
* 주말 근무 가능한 분 환영', '2023-09-10', 1);

-- 9월(2)
insert into recruit(
   recruit_title,
   cid,
    recruit_content,
    reg_date,
    cnt
    )
values
('요리사 모집', 'company1', '요리사를 모집합니다. 요리 경험이 있는 분 환영합니다.
* 채용인원: 1명
* 급여: 협의
* 정규직 채용
* 경력자 우대
* 연휴 근무 가능
* 한식 조리사 자격증 소지자 우대', '2023-09-11', 1),
('[급구] 요리사 채용', 'company2', '대기업 [장가]에서 근무할 성실한 요리 스테프를 모집합니다! 많은 지원 부탁드립니다.
* 채용인원: 1명
* 급여: 업계최고
* 정규직 채용
* 경력자 우대
* 연휴 근무
* 한식 조리사 자격증 소지자 우대', '2023-09-12', 1),
('한식 조리사 채용', 'company3', '한식 조리사를 모집합니다. 경력자 우대합니다.
* 채용인원: 1명
* 급여: 협의
* 정규직 채용
* 경력자 우대
* 식당 업무 경험자 환영', '2023-09-13', 1),
('[신입] 주방 스탭 채용', 'company3', '신입 주방 스탭을 모집합니다. 요리에 관심 있는 분 환영합니다.
* 채용인원: 2명
* 급여: 시급
* 아르바이트 채용
* 학생 및 초심자 환영
* 주말 근무 가능한 분 우대', '2023-09-14', 1),
('[경력자] 한식 메인 셰프 채용', 'company1', '경력자 서빙 스탭을 모집합니다. 한식_레스토랑에서의 경험이 있는 분 우대.
* 채용인원: 1명
* 급여: 회사 내규
* 정규직 채용
* 경력자 우대
* 주말 근무 가능한 분 우대', '2023-09-14', 1),
('김콩쥐 요리사님 보조요리사 채용', 'company1', '유명셰프 김콩쥐님의 보조 요리사를 모집합니다.
* 채용인원: 1명
* 급여: 업계최고
*  정규직 채용
* 경력 무관
* 주말 근무 가능한 분 환영', '2023-09-16', 1);

select * from recruit;
UPDATE recruit SET recruit_magam = '7' WHERE recruit_magam IS NULL;
SET SQL_SAFE_UPDATES = 0; 

UPDATE recruit
SET realMagam = DATE_ADD(reg_date, INTERVAL recruit_magam DAY)
WHERE recruit_magam = 7;

ALTER TABLE recruit
ADD cname VARCHAR(100);

UPDATE recruit r
JOIN company c ON r.cid = c.cid
SET r.cname = c.cname;

